# GetRuleName Method (PerformanceAdviserRuleId) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PerformanceAdviser..::..GetRuleName Method (PerformanceAdviserRuleId)
PerformanceAdviser Class See Also
---
Retrieves the name of the rule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string GetRuleName(
	PerformanceAdviserRuleId id
)
```

Visual Basic
---
```text
Public Function GetRuleName ( _
	id As PerformanceAdviserRuleId _
) As String
```

Visual C++
---
```text
public:
String^ GetRuleName(
	PerformanceAdviserRuleId^ id
)
```

# ### Parameters
id
    Type: Autodesk.Revit.DB..::..PerformanceAdviserRuleId The rule id to get information for.
# ### Return Value
The name of the rule.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PerformanceAdviser Class
GetRuleName Overload
Autodesk.Revit.DB Namespace